Repository: ibrahim-s/almaanyEnglishDictionaries
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ar

source: Almaany English Dictionaries
ar: قواميس المَعاني الإنجليزية

source: Open Almaany english dictionaries dialog, and if word is selected access meaning directly using default dictionary.
ar: فتح محاورةْ قواميس المَعاني الإنجليزية, و في حال كانت الكلمة مُحددة نحصل على معنى الكلمة مباشرة بالقاموس الإفتراضي.

source: Choose default dictionary:
ar: إخترْ القاموس الإفتراضي

source: Default full browser
ar: المتصفح الإفتراضي العادي

source: Browser window only
ar: نافِذةْ المتصفح فقط

source: NVDA browseable message box(choose it after testing)
ar: نافذةْ NVDA للتصفح(قُم باختيارها بعد التجربة)

source: Choose type of window To Display Result:
ar: اختر نوع النافذة لإظهار النتيجة:

source: Close Almaany Dictionaries Dialog after requesting translation
ar: إغلاق محاورةْ قواميس المَعاني بعد طلب الترجمة

source: Translation Result
ar: نتيجةْ الترجمة

source: Enter a word or a phrase
ar: أَدخِلْ عبارة أو كلمة

source: Choose Dictionary
ar: اخترْ القاموس

source: OK
ar: موافق

source: cancel
ar: إلغاء

source: Sorry, An Error Happened({})
ar: عُذراً, لقد حصل خَطَأ({})

source: Retreaves translation of words or phrases in several bilingual English-other language dictionaries. This addon does not have a default gesture.
ar: الحصول على معنى الكلمة أوو العبارة بواسطةْ عِدةْ قواميس ثُنائيةْ الترجمة, مِن الإنجليزية و إليها. ليس هناك اختصار افتراضي لهذه الإضافة.
